t = {"province": "台湾省",
     "lower": [, "基隆市", "辖", "7区：", , "台", "中", "市", "辖", "8区：",, "台", "南", "市", "辖", "7区：", "中", "区、东", "区、南", "区、西", "区、北",
                 "区、安平区、安南区", "新", "竹", "市", "辖", "3区：", "东", "区、北", "区、香山区", "嘉", "义", "市", "辖", "2区：", "东", "区、西",
                 "区", "台", "北", "县", "县治板桥市，辖10市", "4镇15乡：", "板桥市、汐止市、新店市、永和市、中和市、土城市、", "树林市、三重市、新庄市、芦洲市；",
                 "瑞芳镇、三峡镇、莺歌镇、淡水镇、万里乡、金山乡、", "深坑乡、石碇乡、平溪乡、双溪乡、贡寮乡、坪林乡、", "乌来乡、泰山乡、林口乡、五股乡、八里乡、三芝乡、", "石门乡", "宜", "兰",
                 "县", "县治宜兰市，辖", "1市", "3镇", "8乡：", "宜兰市；头城镇、罗东镇、苏澳镇；礁溪乡、壮围乡、", "员山乡、三星乡、大同乡、五结乡、冬山乡、南澳乡", "新", "竹",
                 "县", "县治竹北市，辖", "1市", "3镇", "9乡：", "竹北市；新埔镇、关西镇、竹东镇；湖口乡、新丰乡、", "芎林乡、宝山乡、五峰乡、横山乡、尖石乡、北埔乡、", "峨眉乡", "桃",
                 "园", "县", "县治桃园市，辖", "4市", "2镇", "7乡：", "桃园市、中坜市、平镇市、八德市；杨梅镇、大溪镇；", "龙潭乡、新屋乡、观音乡、龟山乡、复兴乡、大园乡、", "芦竹乡",
                 "苗", "栗", "县", "县治苗栗市，辖", "1市", "6镇11乡：", "苗栗市；", "竹南镇、头份镇、後龙镇、通霄镇、苑裡镇、", "卓兰镇；三湾乡、南庄乡、狮潭乡、造桥乡、头屋乡、",
                 "公馆乡、大湖乡、泰安乡、铜锣乡、三义乡、西湖乡", "台", "中", "县", "县治丰原市，辖", "3市", "5镇13乡：", "丰原市、太平市、大里市；",
                 "东势镇、沙鹿镇、梧栖镇、清水镇、大甲镇；", "雾峰乡、乌日乡、后里乡、石冈乡、和平乡、新社乡、", "潭子乡、大雅乡、神冈乡、大肚乡、龙井乡、外埔乡、", "大安乡", "彰", "化", "县",
                 "县治彰化市，辖", "1市", "7镇18乡：", "彰化市；", "鹿港镇、和美镇、员林镇、溪湖镇、田中镇、北斗镇、", "二林镇；芬园乡、花坛乡、秀水乡、福兴乡、线西乡、",
                 "伸港乡、社头乡、永靖乡、埔心乡、大村乡、埔盐乡、", "田尾乡、埤头乡、溪州乡、竹塘乡、大城乡、芳苑乡、", "二水乡", "南", "投", "县", "县治南投市，辖", "1市", "4镇",
                 "8乡：", "南投市；", "草屯镇、埔里镇、集集镇、竹山镇；", "中寮乡、国姓乡、仁爱乡、名间乡、水里乡、鱼池乡、", "信义乡、鹿谷乡", "嘉", "义", "县", "县治太保市，辖",
                 "2市", "2镇14乡：", "太保市、朴子市；", "大林镇、布袋镇；", "番路乡、梅山乡、竹崎乡、阿里山乡、中埔乡、大埔乡、", "水上乡、鹿草乡、东石乡、六脚乡、新港乡、民雄乡、",
                 "溪口乡、义竹乡", "云", "林", "县", "县治斗六市，辖", "1市", "5镇14乡：", "斗六市；", "斗南镇、虎尾镇、土库镇、西螺镇、北港镇；",
                 "大埤乡、褒忠乡、东势乡、台西乡、崙背乡、麦寮乡、", "林内乡、古坑乡、莿桐乡、二崙乡、水林乡、口湖乡、", "四湖乡、元长乡", "台", "南", "县", "县治新营市，辖", "2市",
                 "7镇22乡：", "新营市、永康市；", "新化镇、麻豆镇、佳里镇、学甲镇、白河镇、盐水镇、", "善化镇；", "归仁乡、左镇乡、玉井乡、楠西乡、南化乡、仁德乡、",
                 "关庙乡、龙崎乡、官田乡、西港乡、七股乡、将军乡、", "北门乡、後壁乡、东山乡、六甲乡、下营乡、柳营乡、", "大内乡、山上乡、新市乡、安定乡", "高", "雄", "县", "县治凤山市，辖",
                 "1市", "3镇23乡：", "凤山市、冈山镇、旗山镇、美浓镇；", "仁武乡、大社乡、路竹乡、阿莲乡、田寮乡、燕巢乡、", "桥头乡、梓官乡、弥陀乡、永安乡、湖内乡、大寮乡、",
                 "林园乡、鸟松乡、大树乡、六龟乡、内门乡、杉林乡、", "甲仙乡、桃源乡、三民乡、茂林乡、茄萣乡", "屏", "东", "县", "县治屏东市，辖", "1市", "3镇29乡：", "屏东市；",
                 "潮州镇、东港镇、恒春镇；三地乡、雾臺乡、玛家乡、", "九如乡、里港乡、高树乡、盐埔乡、长治乡、麟洛乡、", "竹田乡、内埔乡、万丹乡、泰武乡、来义乡、万峦乡、",
                 "嵌顶乡、新埤乡、南州乡、林边乡、琉球乡、佳冬乡、", "新园乡、枋寮乡、枋山乡、春日乡、狮子乡、车城乡、", "牡丹乡、满州乡", "台", "东", "县", "县治台东市，辖", "1市",
                 "2镇13乡：", "台东市；", "关山镇、成功镇；", "绿岛乡、兰屿乡、延平乡、卑南乡、鹿野乡、海端乡、", "池上乡、东河乡、长滨乡、太麻里乡、金峰乡、大武乡、", "达仁乡", "花", "莲",
                 "县", "县治花莲市，辖", "1市", "2镇10乡：", "花莲市；", "凤林镇、玉里镇；", "新城乡、秀林乡、吉安乡、寿丰乡、光复乡、丰滨乡、", "瑞穗乡、万荣乡、卓溪乡、富里乡", "澎",
                 "湖", "县", "县治马公市，辖1市5乡：", "马公市；", "西屿乡、望安乡、七美乡、白沙乡、湖西乡", "“福", "建", "省”", "金门县：金沙镇、金湖镇、金城镇、金宁乡、烈屿乡、",
                 "乌坵乡。", "连江县：南竿镇、北竿乡、莒光乡、东引乡。", "", "", "连江县的一部分，因此仍叫连江县）"]}
new = []
for l in t["lower"]:
    l.replace('、', ',')
    print(l)
    new.append(l)


